[
  {
    "id": 2,
    "title": "Silence and Shadow",
    "author": "Erin Beaty",
    "sagaId": 2,
    "pages": 464,
    "format": "physical",
    "description": "After confronting a killer and fleeing her home to be with each other, Cat and Simon arrive in the sprawling city of Londunium pretending to be a newly married couple, but don’t expect to keep up the ruse for long. Cat looks forward to honing her healing magick at the local Selanae university, but instead finds a council of ruthless leaders threatening to erase her non-Selanae \"husband’s\" memories to protect their secrets.\n\nTerrified to lose him, Cat takes desperate steps to keep him safe. But when a string of mutilated bodies turns up in the woods outside the city, and Simon is recruited to profile the killer, Cat is pulled back into a world of murder, mayhem, and magick—one that threatens to swallow them both.",
    "status": "reading",
    "coverImage": "/images/books/SilenceandShadow.jpg",
    "dateStarted": "2025-05-02",
    "dateFinished": null, 
    "rating": null,
    "language": "en",
    "tags": ["fantasy", "young adult", "romance", "mystery", "magic", "fiction", "young adult fantasy"],
    "favorite": false,
    "progress": 48,
    "isbn": "9781250755841",
    "publisher": "Farrar, Straus and Giroux (BYR)",
    "notesCount": 0
  },
  {
  "id": 3,
  "title": "Los Crímenes de Steamfield",
  "author": "Alberto Rey",
  "sagaId": null,
  "pages": 192,
  "format": "physical",
  "description": "La ciudad de Steamfield es testigo de dos acontecimientos sin precedentes para esta tranquila comunidad: la sucesión de una serie de muertes sin explicación aparente y la aparición de una oscura y densa niebla que se extiende por toda la ciudad. En medio de esta situación, el joven Andrew Anderson recibe una oportunidad soñada que, sin pretenderlo, le empujará hacia una emocionante búsqueda para esclarecer estos hechos. Por suerte, contará con dos nuevos amigos que le acompañarán en esta aventura.",
  "status": "pending",
  "coverImage": "/images/books/LosCrimenesDeSteamfield.jpg",
  "dateStarted": null,
  "dateFinished": null,
  "rating": null,
  "language": "es",
  "tags": ["mystery", "adventure", "fiction"],
  "favorite": false,
  "progress": 0,
  "isbn": "9788418047374",
  "publisher": "Naulibres",
  "notesCount": 0
}

]
